Repository: mohammadpmf/confectionery
Catalog: orders/locale/*/LC_MESSAGES/django.po
Languages: fa

source: Please Enter any further notes if you have some. Otherwise leave theis field empty.
fa: لطفا در صورت نیاز، یادداشت بگذارید. در غیر این صورت، این قسمت را خالی بگذارید.

source: Also change first_name and last_name of my account.
fa: در حساب کاربری من نیز، نام و نام خانوادگی را ذخیره کن.

source: Phone Number
fa: شماره تماس

source: Enter phone number!
fa: شماره تماس را وارد کنید!

source: Phone number should be exactly 11 digits in Iran
fa: شماره تلفن در اینران دقیقا باید ۱۱ رقم باشد.

source: If you have disabled advertising messages, SMS won't send to your number
fa: در صورتی که پیامک های تبلیغاتی را غیر فعال کرده باشید، اس ام اس برای شما ارسال نخواهد شد.

source: Phone number must only contain digits (not alphabet characters!)
fa: شماره تلفن باید فقط از رقم تشکیل شده باشد (نه از حروف الفبا!)

source: Phone number must only contain digits (not punctuations!)
fa: شماره تلفن باید فقط از رقم تشکیل شده باشد (نه از نمادهای نگارشی!)

source: Please enter all digits number carefully and only in english keyboard!
fa: لطفا تمام ارقام شماره تلفن را به دقت وارد کنید و دقت کنید که کیبوردتان انگلیسی باشد.

source: Phone numbers start with 09 in Iran!
fa: شماره تلفن ها در ایران با 09 آغاز میشوند!

source: Text
fa: متن

source: Discount Amount
fa: مقدار تخفیف

source: Discount Percentage
fa: درصد تخفیف

source: Max Discount Amount
fa: حداکثر مقدار تخفیف

source: Limit
fa: حداکثر تعداد استفاده

source: Same User Limit
fa: حداکثر تعداد استفاده برای یک کاربر

source: Used Times
fa: تعداد دفعات استفاده شده

source: Expiration Date
fa: تاریخ مصرف

source: User
fa: کاربر

source: You should choose either discount_amount or discount_percentage! Both of them can't be Null!
fa: شما باید یکی از دو فیلد مقدار تخفیف یا درصد تخفیف را پر کنید. هر دو آنها نمی توانند خالی باشند.

source: You should choose one of discount_amount or discount_percentage! You can't choose both of them at the same time!
fa: شما باید یکی از دو فیلد مقدار تخفیف یا درصد تخفیف را پر کنید. نمی توانید هر دو آن ها را همزمان انتخاب کنید.

source: Discount
fa: تخفیف

source: Is Paid?
fa: پرداخت شده؟

source: First Name
fa: نام

source: Last Name
fa: نام خانوادگی

source: Phone number should be at least 11 digits
fa: شماره تلفن حداقل باید ۱۱ رقم باشد.

source: Phone number should be at most 14 digits
fa: شماره تلفن حداکثر باید ۱۱ رقم باشد.

source: Address
fa: آدرس

source: Order Notes
fa: یادداشت برای سفارش

source: Date Time of creation
fa: زمان ایجاد

source: Date Time of last edit
fa: زمان آخرین ویرایش

source: Order
fa: ثبت سفارش

source: Product
fa: محصول

source: Quantity
fa: تعداد

source: Price
fa: قیمت

source: Payment
fa: پرداخت

source: You can not proceed to checkout because your cart is empty.
fa: شما نمیتوانید به صفحه پرداخت بروید. چون سبد خرید شما خالیست.

source: This discount code is not verified!
fa: کد تخفیف نامعتبر است!

source: Sorry. This discount code is expired!
fa: متاسفانه این کد تخفیف منقضی شده است!

source: Sorry. This discount code is not for your account!
fa: متاسفانه این کد تخفیف مخصوص حساب کاربری شما نیست!

source: Sorry. The maximum use of this discount code has reached for your account!
fa: متاسفانه شما از حداکثر محدودیت تعداد دفعات این کد تخفیف برای حساب کاربری خود استفاده کرده اید.

source: Sorry, the price after discount is less than 10000 Toman. We cant't checkout that order. Please choose another item that make total price more than 10000 Toman.
fa: متاسفیم. اما قیمت سبد خرید شما با تخفیف کمتر از ۱۰۰۰۰ تومان است. لطفا آیتم دیگری انتخاب کنید تا قیمت با تخفیف بیش از ۱۰۰۰۰ تومان شود.

source: Discount successfully applied to your order.
fa: تخفیف با موفقیت روی سفارش شما اعمال شد.
