from django import forms
from django.utils.translation import gettext as _


# اول از این فرم استفاده کردیم و با کریسپی هم دیدیم. اما چون ظاهر اچ تی ام ال خودمون قشنگ تر بود،
# از همون استفاده کردیم. حالا چرا این کد رو اینجا گذاشتیم، به خاطر این که داخل ویوز ازش استفاده
# کنیم و برای بررسی ولید بودن ازش استفاده کنیم. در واقع با این که تو اچ تی ام ال ازش استفاده نکردیم،
# اما اسم متغیرهای فرم اچ تی ام المون رو مثل این گذاشتیم و تو ویوز متغیرهای گرفته شده رو خود
# جنگو با این فرمی که اینجا ساختیم مقایسه میکنه. یعنی اگه کسی اچ تی ام ال رو دور بزنه و مثلا
# هزار تا سفارش بده، خود جنگو هم حالا بهش گیر میده. اگه فرم تعریف نمیکردیم با کد پایتون خودمون
# باید دستی بررسیش میکردیم. اما حالا که فرم تعریف کردیم فقط تابع ایز ولید رو صدا کردیم.
class AddToCartProductForm(forms.Form):
    QUANTITY_CHOICES = [(i, str(i)) for i in range(1, 31)]
    # quantity = forms.TypedChoiceField(choices=QUANTITY_CHOICES, coerce=int)
    # حاجی حسینی این مدلی نوشته بود و کار هم میکرد. اما تابع کلین کوانتیتی که براش
    # مینوشتم کار نمیکرد. تابع کلین خالی نوشتم و ارور میداد که کوانتیتی رو نداره. زدم
    # دیکشنری کلیند دیتا رو پرینت کنه دیدم نیست. در حالی که تو ویوز اونجا میگرفتیمش و ازش
    # استفاده هم کردیم. خلاصه گفتم شاید به خاطر تایپد چویس فیلد باشه. عوضش کردم و خودم
    # اینتجر گذاشتم و کلین کوانتیتی رو نوشتم درست شد. این طوری گذاشتم. این مشکل حل شد
    # اما حواسم باشه که خودم باید مدیریتش کنم. مثلا عدد منفی بهش دادم ذخیره کرد و 
    # وقتی میخواست صفحه اچ تی ام ال رو بیاره به مشکل خورد. مشکلش رو درست کردم و دیدم
    # که تعداد و محصول قیمت منفی هست و داره نشون میده. پس حواسم باشه که باید تابع
    # کلینش رو خیلی تمیز بنویسم یا موقع تعریف فیلدش مشخص کنم چه چیزایی رو خودش
    # بررسی کنه. مثلا الان براش مین ولیو و مکس ولیو گذاشتم، این مورد درست شد و نمیشه منفی داد
    # اما وقتی بالای ۳۰ نوشتم ارور خودش رو داد و نوشته من رو بی خیال شد. در واقع موقع تعریف
    # فیلد باید بهش بگیم چه اروری بده. اولویت با اینه. اما میتونیم تابع کلین هم بنویسیم
    # که تو شرایط خاص چیکار کنه. مثلا من میخوام کسی دقیقا ۷ تا کیک سفارش نده. این مسلما
    # توی فرم نمیشه گفت. اما توی تابع کلینش میتونم خودم بنویسم. پس حواسم باشه که توابع
    # کلین برای جزییات خاص هستند و بهتره که موقع تعریف فیلد ها ارور ها رو مشخص کنیم
    # این شکلی نوشتم همه چیز درسته. نکته آخر این که برای حاجی حسینی هم این رو گذاشتم ولی
    # تو همه حالت های ارور، مینوشت که یک گزینه معتبر انتخاب کنید. فلان چیز که نوشتی معتبر
    # نیست. احتمالا برای این گذاشته بود که مشکل کمتری پیش بیاد و تایپد چویس فیلد
    # دقیقا از بین گزینه هایی که بهش دادیم باید باشه. وگرنه اون ارور رو میده که خب
    # امنیت بالا تری داره. به هر حال من این اینتجر رو گذاشتم و این ۳ تا حالت رو بهش دادم
    # ارور های درستی نشون میداد. اما گفتم حالت دیگه هم شاید باشه. مثلا نوشتم ۳.۵ و وارد کردم
    # خودش مینوشت به طور کامل یک عدد وارد کنید. یا مثلا نوشتم سلام باز هم همین ارور رو میداد
    # پس خودش هم بعضی چیزها رو بررسی میکنه. اما حواسم باز باشه.
    quantity = forms.IntegerField(min_value=1, max_value=30, error_messages={
        'required' : _('Enter number of product!'),
        'min_value' : _("Number of products can't be negative or zero! If you don't want it, you can remove it from your cart."),
        'max_value' : _("Number of products can't be more than 30. If you have a big, order, please contact 09356640204."),
        })
    inplace = forms.BooleanField(required=False, widget=forms.HiddenInput)
    # این اتریبیوت اینپلیس رو برای این تعریف کردیم که بشه هم از تو خود محصول آیتم رو اضافه کرد
    # و هم از تو سبد خرید مقدار نهایی رو مشخص کرد. این دو تا فرق داره. اگه ۳ تا جوراب داشته باشیم
    # و بریم تو صفحه جوراب رو ۲ بزنیم باید ۲ تا به ۳ تای قبلی اضافه بشه و بشه ۵ تا.
    # اما اگه تو سبد خرید جوراب رو بزنیم ۳ تا یعنی میخوایم مقدار نهاییش ۳ تا باشه و جمع نمیشه.
    # به همین منظور این متغیر رو تعریف کردیم. اجباری نیست. چون تو صفحه خود جزییات محصول که میخوایم
    # اضافه کنیم نباید باشه. یعنی اونجا اینپلیس فالس هست. از طرفی خود کاربر هم نباید بفرسته. خودمون
    # میفرستیم با اچ تی ام ال. پس هیدن هم میذاریمش. تو صفحه سبد خرید هم همین طور. خود کاربر باهاش
    # کاری نداره. ما میذاریم که بدونیم توی اون صفحه هستیم و مقدار ترو اونجا بهش میدیم.
