Repository: mohammadpmf/confectionery
Catalog: accounts/locale/*/LC_MESSAGES/django.po
Languages: fa

source: Personal info
fa: اطلاعات شخصی

source: Permissions
fa: دسترسی ها

source: Important dates
fa: تاریخ های مهم

source: Password must be at least 8 characters
fa: رمز عبور باید حداقل ۸ کاراکتر باشد

source: Password must have at least one digit
fa: رمز عبور باید حداقل یک عدد داشته باشد

source: Password can not be only a number
fa: رمز عبور نمیتواند فقط عدد باشد

source: Profile Picture
fa: عکس پروفایل

source: Remove Profile Picture
fa: عکس کاربری را حذف کن

source: Username
fa: نام کاربری

source: OTP Phone Number
fa: شماره تلفن (جهت دریافت رمز یکبار مصرف)

source: Female
fa: زن

source: Male
fa: مرد

source: National Code
fa: کد ملی

source: National code must be exactly 10 digits
fa: کد ملی باید دقیقا ۱۰ رقم باشد

source: Gender
fa: جنسیت

source: email address
fa: آدرس ایمیل

source: Phone number
fa: شماره تلفن

source: Phone number should be at least 11 digits
fa: شماره تلفن باید حداقل ۱۱ رقم باشد

source: Phone number should be at most 14 digits
fa: شماره تلفن باید حداکثر ۱۴ رقم باشد

source: User
fa: کاربر

source: Phone number must be at exactly 11 digits in Iran to receive sms
fa: شماره تلفن در ایران باید دقیقا ۱۱ رقم باشد تا امکان دریافت پیامک داشته باشد

source: Image
fa: عکس

source: Change Profile Info
fa: تغییر اطلاعات شخصی

source: Change Username
fa: تغییر نام کاربری

source: A verification code sent to %s. Please enter the recieved code to continue.
fa: یک پیامک برای شماره %s ارسال شد. لطفا کد ارسال شده را جهت ادامه وارد کنید.

source: A problem occured in sending message. Please try again in a few minutes.
fa: متاسفانه در ارسال اس ام اس خطایی پیش آمده. لطفا چند دقیقه بعد مجددا تلاش کنید.

source: A problem occured in sms message server. Please try again in a few minutes.
fa: متاسفانه در سرور ارسال اس ام اس خطایی رخ داده است. لطفا چند دقیقه بعد مجددا تلاش کنید.

source: Welcome %s
fa: خوش آمدی %s

source: Successfull Login.
fa: ورود موفقیت آمیز.

source: Sorry! This phone number already has an account. If it's yours and you can't use it, contact the moderator of the site.
fa: متاسفیم! این شماره تلفن هم اکنون استفاده شده است. اگر برای شماست و نمیتوانید از آن استفاده کنید، با مدیریت سایت تماس بگیرید!

source: Sorry. OTP is invalid!
fa: متاسفانه یکبار رمز به درستی وارد نشده است!

source: Your choice accepted successfully! That page won't be shown to you next time!
fa: انتخاب شما با موفقیت ثبت شد. دفعه بعد، پس از ورود آن صفحه به شما نمایش داده نمی شود.

source: Your info updated successfully! Please login again!
fa: اطلاعات شما با موفقیت ویرایش شد. لطفا مجددا وارد شوید.

source: Ok. You are in a hurry! We will show you this form next time.
fa: باشه. شاید الان عجله دارید. در ورود بعدی مجددا این فرم به شما نمایش داده میشود.

source: Information has been updated successfully!
fa: اطلاعات با موفقیت به روز رسانی شد.

source: Username updated successfully!
fa: نام کاربری با موفقیت به روزرسانی شد.

source: Email address updated successfully!
fa: آدرس ایمیل با موفقیت به روزرسانی شد.

source: Someone already is using this number!
fa: شخصی هم اکنون این شماره را ثبت کرده است.

source: OTP Phone number updated successfully!
fa: شماره همراه جهت دریافت یکباررمز با موفقیت به روزرسانی شد.
