Repository: mohammadpmf/confectionery
Catalog: cart/locale/*/LC_MESSAGES/django.po
Languages: fa

source: Product successfully updated
fa: محصول با موفقیت ویرایش شد.

source: Number of products should be an integer number!
fa: تعداد محصولات باید یک عدد صحیح باشد.

source: Number of products can't be more than 30. If you have a big, order, please contact 09356640204.
fa: تعداد محصولات سفارشی نمیتواند بیش از ۳۰ عدد باشد. در صورتی که سفارش بزرگی دارید، لطفا با شماره ۰۹۳۵۶۶۴۰۲۰۴ تماس بگیرید.

source: Number of products can't be less than 1. If you don't wan't it, you can remove it from your cart.
fa: تعداد محصولات سفارشی نمیتواند کمتر از ۱ باشد. در صورتی که محصول را نمیخواهید، میتوانید آن را از سبد خرید خود حذف کنید.

source: Product successfully added to cart
fa: محصول با موفقیت به سبد خرید اضافه شد.

source: Product successfully removed from cart
fa: محصول با موفقیت از سبد خرید شما حذف شد.

source: Enter number of product!
fa: تعداد محصول را وارد کنید!

source: Number of products can't be negative or zero! If you don't want it, you can remove it from your cart.
fa: تعداد محصولات نمیتواند منفی یا ۰ باشد. در صورتی که محصول را نمی خواهید، می توانید آن را از سبد خرید خود حذف کنید.

source: User
fa: کاربر

source: Cart
fa: سبد خرید

source: Product
fa: محصول

source: Quantity
fa: تعداد

source: Cart Detail
fa: سبد خرید

source: Empty Cart
fa: خالی کردن سبد خرید

source: total
fa: جمع کل

source: Go to Cart
fa: برو به سبد خرید

source: Checkout
fa: پرداخت

source: All products successfully removed from your cart
fa: تمام محصولات با موفقیت از سبد خرید شما حذف شدند.

source: Your cart is already empty.
fa: سبد خرید شما از قبل خالیست.
