Repository: mohammadpmf/confectionery
Catalog: confectionery/locale/*/LC_MESSAGES/django.po
Languages: fa

source: Weight in Kgs
fa: وزن به کیلوگرم

source: Less than 1 Kg
fa: کمتر از یک کیلوگرم

source: 1 to 1.5 Kg
fa: ۱ تا ۱.۵ کیلوگرم

source: 1.5 to 2 Kg
fa: ۱.۵ تا ۲ کیلوگرم

source: More than 2 Kgs
fa: بیشتر از ۲ کیلوگرم

source: Price in Tomans
fa: قیمت به تومان

source: price
fa: قیمت

source: Cheapest
fa: ارزان ترین ها

source: Cheap
fa: ارزان

source: Average
fa: متوسط

source: Expensive
fa: گران

source: The most expensive
fa: گران ترین ها

source: Cake
fa: کیک

source: Pastry
fa: شیرینی

source: Bread
fa: نان

source: Wheat
fa: گندم

source: Corn
fa: ذرت

source: Rice
fa: برنج

source: Oat
fa: جو

source: High
fa: زیاد

source: Low
fa: کم

source: Title
fa: عنوان

source: Product Type
fa: نوع محصول

source: Flour Type
fa: نوع آرد

source: Sugar Rate
fa: میزان قند

source: Fat Rate
fa: میزان چربی

source: Slug
fa: اسلاگ

source: Weight
fa: وزن

source: Price Toman
fa: قیمت به تومان

source: Preparation Time
fa: مدت زمان آماده سازی (به روز)

source: Ingredients
fa: اجزای سازنده

source: Expiration Days
fa: ماندگاری (به روز)

source: Main Image
fa: عکس اصلی

source: Extra Information
fa: اطلاعات بیشتر

source: product
fa: محصول

source: image
fa: عکس

source: comment text
fa: متن کامنت

source: author
fa: نویسنده

source: is approved
fa: تایید شده

source: fantastic
fa: شگفت انگیز

source: excellent
fa: عالی

source: good
fa: خوب

source: average
fa: معمولی

source: bad
fa: بد

source: don't show my name
fa: نام من را نمایش نده

source: user's rate
fa: رای کاربر به این محصول

source: user
fa: کاربر

source: About Us
fa: درباره ما

source: Welcome To Motamed Confectionery
fa: به وبسایت کیک و شیرینی معتمد خوش آمدید

source: Product List
fa: لیست محصولات

source: Home
fa: خانه

source: Menu & Pricing
fa: منو و قیمت ها

source: Explore Our Cakes
fa: از محصولات بازدید کنید

source: Cakes
fa: کیک ها

source: Read More
fa: بیشتر بخوانید

source: Pastries
fa: شیرینی ها

source: Breads
fa: نان ها

source: 30%% Discount For This Summer
fa: ٪۳۰ تخفیف در تابستان امسال

source: Team Members
fa: اعضای گروه

source: Our Master Chefs
fa: سرآشپزهای ما

source: %s successfully added to your favorites.
fa: %s با موفقیت به لیست علاقه مندی های شما اضافه شد.

source: %s successfully removed from your favorites.
fa: %s با موفقیت از لیست علاقه مندی های شما حذف شد.
